<script setup lang="ts">

import { ref } from 'vue';
import Accordion from '../components/Accordion.vue';
import fifthClassContent from '../text_content/fifth_class.json';

const content = ref(fifthClassContent);
</script>

<template>
  <!--  <h1>Доисторический период</h1>
  <ol>
    <li>Введение в изучение истории древнего мира. Как работать с учебником по истории?</li>
    <li>Происхождение и эволюция человека.</li>
    <li>Занятия человека в доисторический период.</li>
    <li>Формы социальной организации в доисторический период.</li>
    <li>Возникновение верований и искусства.</li>
    <li>Следы возникновения доисторического человека в румынском пространстве. Цивилизация Кукутень-Триполье.</li>
    <li>Практические занятия/деятельность: например, Летоисчисление в истории. Перенос элементов Математики и Обществознания в подсчет годов и описание историко-географического пространства.</li>
    <li>Обучающая проектная деятельность: Письмо, адресованное древнему человеку.</li>
  </ol>-->
  <accordion
    :header="content.content[0].header"
    :content-list="content.content[0].list"
  />
  <!--  <h1>Древняя эпоха. Древний Восток</h1>
  <ol>
    <li>Человек и окружающая среда в Древнем Востоке.</li>
    <li>Народы Древнего Востока.</li>
    <li>Царства и империи. Древний Египет.</li>
    <li>Древняя Месопотамия. Вавилон.</li>
    <li>Персия.</li>
    <li>Древняя Индия и Древний Китай.</li>
    <li>Культура и цивилизация народов Древнего Востока. Письменность.</li>
    <li>Практические занятия/деятельность: например,Упражнения по формулированию сообщений на основе информации, выбранной из источников.</li>
    <li>Тематическое исследование: Семь чудес света.</li>
    <li>Суммативное оценивание №1: Древний мир. Древний Восток.</li>
  </ol>-->
  <accordion
    :header="content.content[1].header"
    :content-list="content.content[1].list"
  />
  <h1>Европа в античную эпоху. Древняя Греция </h1>
  <ol>
    <li>Крито-микенская цивилизация.</li>
    <li>Гомеровская Греция.</li>
    <li>Формирование полисов. Великая греческая колонизация.</li>
    <li>Афины и Спарта.</li>
    <li>Перикл и его эпоха.</li>
    <li>Возвышение Македонии. Империя Александра Великого.</li>
    <li>Наследие греческого мира. Тематическое исследование: Олимпийские игры.</li>
    <li>Практические занятия/деятельность:например, Использование информации из разных исторических источников в изложении событий Древней эпохи.</li>
    <li>Суммативное оценивание №2: Древняя Греция – колыбель цивилизации.</li>
    <li>Анализ оценивания.</li>
  </ol>
  <h1>Фрако-гето-дакийская цивилизация</h1>
  <ol>
    <li>Фракийцы.</li>
    <li>Гето-даки. Сармисегетуза.</li>
    <li>Отношения гето-даков с соседями.</li>
    <li>Объединение Дакии под руководством Буребисты.</li>
    <li>Образ жизни и религия гето-даков.</li>
    <li>Практические занятия/деятельность:Оценка роли личности/выявление причин и последствий.</li>
    <li>Урок синтеза: например,Античные авторы о гето-даках.</li>
    <li>Обучающая проектная деятельность: Мини-исследование: Эволюция некоторых предметов, орудий труда во времени.</li>
  </ol>
  <h1>Европа в античную эпоху. Древний Рим.</h1>
  <ol>
    <li>Человек и окружающая среда на Апеннинском полуострове.</li>
    <li>Основание Рима - история и легенда. Период царства.</li>
    <li>Римская республика. Экспансия Рима в Средиземноморье.</li>
    <li>Римская империя.</li>
    <li>Культура Древнего Рима и ее вклад в развитие других народов. Великие авторы и шедевры.</li>
    <li>Тематическое исследование: История календаря.</li>
    <li>Влияние цивилизации Древнего Рима на другие народы.</li>
    <li>Верования и возникновение христианства.</li>
    <li>Практические занятия/деятельность: например,Изложение роли личности в истории для развития личностных качеств и установления связи между причинами и событиями.</li>
    <li>Урок синтеза: например, Личности Древнего Рима.</li>
    <li>Суммативное оценивание №3: Европа в Древний период. Древний Рим.</li>
  </ol>
  <h1>Даки и римляне </h1>
  <ol>
    <li>Развитие Дакии в период Децебала.</li>
    <li>Дако-римские войны.</li>
    <li>Дакия под римским господством.</li>
    <li>Романизация гето-даков.</li>
    <li>Дако-римляне и мигрирующие народы.</li>
    <li>Христианство к северу от Дуная.</li>
    <li>Культурное наследие гето-даков. Культурные интерференции в пространстве предков в древности.</li>
    <li>Тематическое исследование: Колонна Траяна.</li>
    <li>Практические занятия/деятельность: например,Признание памятников древней истории частью всемирного культурного наследия.</li>
    <li>Урок синтеза: например,Крепости в горах Орэштии - стратегический центр дакийской оборонительной системы.</li>
  </ol>
  <h1>Закат античного мира</h1>
  <ol>
    <li>Кризис Римской империи.</li>
    <li>Варварские народы и упадок древнего мира.</li>
    <li>Древняя культура – сокровищница общечеловеческой культуры.</li>
    <li>Значение древнего мира для истории.</li>
    <li>Практические занятия/деятельность: например, Построение схемы причина-событие-последствие.</li>
    <li>Суммативное оценивание №4: Закат античного мира.</li>
  </ol>
</template>

<style scoped lang="scss">

</style>
